-- +goose Up
-- +goose StatementBegin
insert into currency (currency_num_code, currency_char_code, currency_name)
values
('036', 'AUD', 'Австралийский доллар'),
('944', 'AZN', 'Азербайджанский манат'),
('826', 'GBP', 'Фунт стерлингов'),
('051', 'AMD', 'Армянских драмов'),
('933', 'BYN', 'Белорусский рубль'),
('975', 'BGN', 'Болгарский лев'),
('986', 'BRL', 'Бразильский реал'),
('348', 'HUF', 'Форинтов'),
('704', 'VND', 'Донгов'),
('344', 'HKD', 'Гонконгский доллар'),
('981', 'GEL', 'Лари'),
('208', 'DKK', 'Датская крона'),
('784', 'AED', 'Дирхам ОАЭ'),
('840', 'USD', 'Доллар США'),
('978', 'EUR', 'Евро'),
('818', 'EGP', 'Египетских фунтов'),
('356', 'INR', 'Индийских рупий'),
('360', 'IDR', 'Рупий'),
('398', 'KZT', 'Тенге'),
('124', 'CAD', 'Канадский доллар'),
('634', 'QAR', 'Катарский риал'),
('417', 'KGS', 'Сомов'),
('156', 'CNY', 'Юань'),
('498', 'MDL', 'Молдавских леев'),
('554', 'NZD', 'Новозеландский доллар'),
('578', 'NOK', 'Норвежских крон'),
('985', 'PLN', 'Злотый'),
('946', 'RON', 'Румынский лей'),
('960', 'XDR', 'СДР (специальные права заимствования)'),
('702', 'SGD', 'Сингапурский доллар'),
('972', 'TJS', 'Сомони'),
('764', 'THB', 'Батов'),
('949', 'TRY', 'Турецких лир'),
('934', 'TMT', 'Новый туркменский манат'),
('860', 'UZS', 'Узбекских сумов'),
('980', 'UAH', 'Гривен'),
('203', 'CZK', 'Чешских крон'),
('752', 'SEK', 'Шведских крон'),
('756', 'CHF', 'Швейцарский франк'),
('941', 'RSD', 'Сербских динаров'),
('710', 'ZAR', 'Рэндов'),
('410', 'KRW', 'Вон'),
('392', 'JPY', 'Иен');

-- +goose StatementEnd

-- +goose Down
-- +goose StatementBegin
truncate currency;
-- +goose StatementEnd
